
-- Запросы:
-- 1. Выбрать компьютеры, в которых есть комплектующие,
--      использовавшиеся только на этом компьютере (нигде больше).
-- 2. Выбрать комплектующие, для которых нет замен.
-- 3. Выбрать самое дешевое комплектующее для каждой категории.
-- 4. Вывести комплектующие,
--      которые находятся на первых 3 местах по уровню востребованности
--      (наиболее часто используемые во всех собранных компьютерах).
--      Примечание: если уровень востребованности
--      у двух комплектующих одинаковый, то обе находятся на одном месте.
-- 5. Вывести компьютеры с рентабельностью свыше 30%
--      (цена продажи на 30% больше стоимости производства).



